{
    "title": "Present/2018",
    "stats": {},
    "data_tables": [
        {
            "Recipients": [
                {
                    "NPC": "Black Bear",
                    "Requirements": "-",
                    "Rewards": "1,000 Honey\n x5 Sunflower Field Boost\n1 Royal Jelly\n1 Magic Bean\n1 Glitter"
                },
                {
                    "NPC": "Mother Bear",
                    "Requirements": "-",
                    "Rewards": "x5 Dandelion Field Boost\n25 Tickets\n50 Pineapples\n50 Blueberries\n50 Sunflower Seeds\n50 Strawberries"
                },
                {
                    "NPC": "Brown Bear",
                    "Requirements": "-",
                    "Rewards": "x4 Clover Field Boost\n1 Star Jelly"
                },
                {
                    "NPC": "Panda Bear",
                    "Requirements": "-",
                    "Rewards": "5,000 Honey\n x4 Bamboo Field Boost\n1 Rage Bee Jelly\n15 Stingers\n10 Tickets"
                },
                {
                    "NPC": "Science Bear",
                    "Requirements": "-",
                    "Rewards": "x4 Pineapple Patch Boost\nOil Buff\nEnzymes Buff\nGlue Buff\n3 Glues\n5 Royal Jellies\n1 Enzymes"
                },
                {
                    "NPC": "Polar Bear",
                    "Requirements": "-",
                    "Rewards": "x4 Pumpkin Patch Boost\n x10 Polar Power\n3 Oils\n2,500 Treats"
                },
                {
                    "NPC": "Onett",
                    "Requirements": "-",
                    "Rewards": "x1 Boost for every field\nOil Buff\nEnzymes Buff\nGlue Buff\n50,000 Treats\n5 Magic Beans"
                },
                {
                    "NPC": "Gifted Bucko Bee",
                    "Requirements": "NPC must have been given a Translator.",
                    "Rewards": "x3 Boost for every Blue field\nBlue Extract Buff\n5 Blue Extracts"
                },
                {
                    "NPC": "Gifted Riley Bee",
                    "Requirements": "NPC must have been given a Translator.",
                    "Rewards": "x3 Boost for every Red field\nRed Extract Buff\n5 Red Extracts"
                },
                {
                    "NPC": "Stick Bug",
                    "Requirements": "NPC must have been given a Translator.",
                    "Rewards": "33,333,333 Honey\n3 Enzymes\n3 Stingers\n3 Tickets\n⚠️ Summons Stick Bug Challenge"
                }
            ]
        },
        {
            "Dialogue": [
                {
                    "NPC": "Black Bear",
                    "Dialogue": "Oh, hello there!\n-Present Given-\nFor me? You shouldn't have! Let's see what it is... Oh, a jar of honey imported from the tropics! I can taste distinct notes of banana and mango. Delicious! You know me too well. I've got you a little something as well. Merry Beemas!\""
                },
                {
                    "NPC": "Brown Bear",
                    "Dialogue": "What's up, bud?\n-Present Given-\nAh, of course! Time to exchange some Beesmas gifts. Let me see what you got me this year... Whoa! A 1 year subscription to Bearmazon Prime! I'll get so much out of this, you have NO idea! Thanks buddy. Here's a little something I know you'll love as well."
                },
                {
                    "NPC": "Mother Bear",
                    "Dialogue": "There is nothing more magical than Beesmas!\n-Present Given-\nOoooh! What a wonderful surprise! What could it possibly be? Aww! A lovely framed photo of me and my cubs. How incredibly sweet of you! Well now, I've got something for you as well. You didn't expect me to forget my favorite beekeeper on Beesmas, did you?"
                },
                {
                    "NPC": "Panda Bear",
                    "Dialogue": "What?\n-Present Given-\nOh yeah, Beesmas. What've you got here. ... WOW, an automatic monster respawn timer! Sends a notification every time the Werewolf respawns. That's a Beesmas gift I'll actually use. Thanks, I appreciate it. Oh, and here's something for you. Now let's get back to work. The bugs don't break for Beesmas."
                },
                {
                    "NPC": "Science Bear",
                    "Dialogue": "Enjoying the lights I strung up?\n-Present Given-\nAh yes, a Beesmas Gift! I'll have you know I'm hard to impress. Let's see... Oh! A textbook documenting rare, peculiar, and endangered languages! Oh look, unspoken language too: smoke signals, sign language, Silbo Gomero... This may offer some valuable insights that'll help forward my Translator project! Thank you very much. And here's something for you too, of course!"
                },
                {
                    "NPC": "Polar Bear",
                    "Dialogue": "My cousin's something else, isn't he?\n-Present Given-\nLook, I love the winter. Cool and comfortable. But don't get me started on Beesmas. If you grew up with up my family, you'd be sick of it too. Bee Bear's not magical. He's a polar bear in a bee suit. But he brings me something delicious every year, so I can't complain. What did he whip up this time? Oooh yeahh! A 12 pack of frozen truffle and sharp cheddar mac-and-cheese meals! I'll heat some up right now, you and your bees have to try this. It's my favorite. ...(beep beep)... ...(szzzzzzzzzzz)... ...(DING)... Mmmmm, delicious! Everyone's got their quirks, you know. At the end of the day, Bee Bear is still a nice guy. Here, I've prepared something special for you too. Happy Honeydays!"
                },
                {
                    "NPC": "Onett",
                    "Dialogue": "The heck is Beesmas? A friend of mine on Roblox named Younite messaged me a few weeks ago, His friend Mah_Bucket has apparently been hosting a bee-themed Christmas event on Roblox for years! I couldn't say no! Seriously, it's called \"Beesmas\" and just look at this game. And when they showed me Bubble Bee Man I was in awe. But I don't have a good track record with getting out fast updates... I'm already late... It was only recently that I realized I've been twisting this lid the wrong way for months. So here we are, hope this cuts it for now. I'll need to do something again next week to close out the holidays.\n-Present Given-\nOoooo I wonder what this could be! lol Wow! A hastily drawn icon of a Christmas present! Thanks a lot. But you know what I really want? To go on vacation in January and not think about bees for a whole month. I’ve got some more lid-related things to attend to first. Here’s your secret reward for gifting a  to me!\""
                },
                {
                    "NPC": "Gifted Riley Bee",
                    "Dialogue": "Can't stand this cold! You know us here at the Red HQ - we're all about that HEAT! But you know what, I'd be lying if I said it didn't look pretty.\n-Present Given-\nGET OUT!!!!!! Awee, see, I was right when I took you to be a fine beekeeper. And a good person too! So what'd you get me?? ... RIGHT ON! It's a strawberry scented air freshener! The kind you hang on the reer  view mirror of a car. I don't have a car, and I can't smell it very well out here... BUT I LOVE IT! Here, here - this is for you. MERRY BEESMAS from the Red Bees at the Red Headquarters!"
                },
                {
                    "NPC": "Gifted Bucko Bee",
                    "Dialogue": "The cool, calm spirit of winter of reflects the nature of us blue bees. Still yet thoughtful. Calm and steady. That's what gives us our edge.\n-Present Given-\nHah hah, of course you'd do this. Surprise me with a Present out of the blue! You're a stand up beekeeper, you know that? Let me just open this thing up... ...(krumple krumple)... Nice! Some tickets to see the Blue Bee Group in Vegas. Not sure how I'll get there or when I'll find the time to go, But it doesn't look like they expire. Now's your turn! A little something from all us Blue Bees at the HQ."
                },
                {
                    "NPC": "Stick Bug",
                    "Dialogue": "Beesmas is just another day. Like any other day, it's a day to boogie. Holidays come and go. They blow past me like leaves in the wind until they crumble away. But me and my nymphs, we've been dancing forever. Heh heh.\n-Present Given-\nYou're full of surprises, flesh-bug. Let's take a look in the box. A reel-to-reel machine? How did you fit this in there? Very cool. Let me set this up. ... Now let's give it a whirl."
                }
            ]
        }
    ]
}